<%@page import="com.xiaoxiaomo.storm.core.entity.LatLngBean"%>
<%@ page language="java" import="java.util.*" pageEncoding="utf-8"%>
<%
String path = request.getContextPath();
String basePath = request.getScheme()+"://"+request.getServerName()+":"+request.getServerPort()+path+"/";
%>

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
    <meta charset="utf-8">
    <title>ECharts</title>
</head>
<body>
  <!-- ECharts鍗曟枃浠跺紩鍏� -->
   <script src="http://echarts.baidu.com/build/dist/echarts.js"></script>
   <script type="text/javascript">
        // 璺緞閰嶇疆
        require.config({
            paths: {
                echarts: 'http://echarts.baidu.com/build/dist'
            }
        });
    </script>
<script  type="text/javascript">
option = {
		//backgroundColor: '#FF8247',
	    title : {
	        text: '缃戠珯鍖哄煙璁块棶鎯呭喌',
	        subtext: 'data from xxo',
	        sublink: 'http://www.xiaoxiaomo.com',
	        x:'center'
	    },
	    tooltip : {
	        trigger: 'item'
	    },
	    legend: {
	        orient: 'vertical',
	        x:'left',
	        data:['璁块棶閲�']
	    },
	    dataRange: {
	        min : 0,
	        max : ${maxnum},
	        calculable : true,
	        color: ['maroon','purple','red','orange','yellow','lightgreen']
	    },
	    toolbox: {
	        show : true,
	        orient : 'vertical',
	        x: 'right',
	        y: 'center',
	        feature : {
	            mark : {show: true},
	            dataView : {show: true, readOnly: false},
	            restore : {show: true},
	            saveAsImage : {show: true}
	        }
	    },
	    series : [
	        {
	            name: '璁块棶閲�',
	            type: 'map',
	            mapType: 'china',
	            hoverable: false,
	            roam:true,
	            data : [],
	            markPoint : {
	                symbolSize: 5,       // 鏍囨敞澶у皬锛屽崐瀹斤紙鍗婂緞锛夊弬鏁帮紝褰撳浘褰负鏂瑰悜鎴栬彵褰㈠垯鎬诲搴︿负symbolSize * 2
	                itemStyle: {
	                    normal: {
	                        borderColor: '#87cefa',
	                        borderWidth: 1,            // 鏍囨敞杈圭嚎绾垮锛屽崟浣峱x锛岄粯璁や负1
	                        label: {
	                            show: false
	                        }
	                    },
	                    emphasis: {
	                        borderColor: '#1e90ff',
	                        borderWidth: 5,
	                        label: {
	                            show: false
	                        }
	                    }
	                },
	                data : ${datastr}
	            },
	            geoCoord: {
	                "娴烽棬":[121.15,31.89],
	                "閯傚皵澶氭柉":[109.781327,39.608266],
	                "鎷涜繙":[120.38,37.35],
	                "鑸熷北":[122.207216,29.985295],
	                "榻愰綈鍝堝皵":[123.97,47.33],
	                "鐩愬煄":[120.13,33.38],
	                "璧ゅ嘲":[118.87,42.28],
	                "闈掑矝":[120.33,36.07],
	                "涔冲北":[121.52,36.89],
	                "閲戞槍":[102.188043,38.520089],
	                "娉夊窞":[118.58,24.93],
	                "鑾辫タ":[120.53,36.86],
	                "鏃ョ収":[119.46,35.42],
	                "鑳跺崡":[119.97,35.88],
	                "鍗楅��":[121.05,32.08],
	                "鎷夎惃":[91.11,29.97],
	                "浜戞诞":[112.02,22.93],
	                "姊呭窞":[116.1,24.55],
	                "鏂囩櫥":[122.05,37.2],
	                "涓婃捣":[121.48,31.22],
	                "鏀�鏋濊姳":[101.718637,26.582347],
	                "濞佹捣":[122.1,37.5],
	                "鎵垮痉":[117.93,40.97],
	                "鍘﹂棬":[118.1,24.46],
	                "姹曞熬":[115.375279,22.786211],
	                "娼窞":[116.63,23.68],
	                "涓逛笢":[124.37,40.13],
	                "澶粨":[121.1,31.45],
	                "鏇查潠":[103.79,25.51],
	                "鐑熷彴":[121.39,37.52],
	                "绂忓窞":[119.3,26.08],
	                "鐡︽埧搴�":[121.979603,39.627114],
	                "鍗冲ⅷ":[120.45,36.38],
	                "鎶氶『":[123.97,41.97],
	                "鐜夋邯":[102.52,24.35],
	                "寮犲鍙�":[114.87,40.82],
	                "闃虫硥":[113.57,37.85],
	                "鑾卞窞":[119.942327,37.177017],
	                "婀栧窞":[120.1,30.86],
	                "姹曞ご":[116.69,23.39],
	                "鏄嗗北":[120.95,31.39],
	                "瀹佹尝":[121.56,29.86],
	                "婀涙睙":[110.359377,21.270708],
	                "鎻槼":[116.35,23.55],
	                "鑽ｆ垚":[122.41,37.16],
	                "杩炰簯娓�":[119.16,34.59],
	                "钁姦宀�":[120.836932,40.711052],
	                "甯哥啛":[120.74,31.64],
	                "涓滆帪":[113.75,23.04],
	                "娌虫簮":[114.68,23.73],
	                "娣畨":[119.15,33.5],
	                "娉板窞":[119.9,32.49],
	                "鍗楀畞":[108.33,22.84],
	                "钀ュ彛":[122.18,40.65],
	                "鎯犲窞":[114.4,23.09],
	                "姹熼槾":[120.26,31.91],
	                "钃幈":[120.75,37.8],
	                "闊跺叧":[113.62,24.84],
	                "鍢夊唱鍏�":[98.289152,39.77313],
	                "骞垮窞":[113.23,23.16],
	                "寤跺畨":[109.47,36.6],
	                "澶師":[112.53,37.87],
	                "娓呰繙":[113.01,23.7],
	                "涓北":[113.38,22.52],
	                "鏄嗘槑":[102.73,25.04],
	                "瀵垮厜":[118.73,36.86],
	                "鐩橀敠":[122.070714,41.119997],
	                "闀挎不":[113.08,36.18],
	                "娣卞湷":[114.07,22.62],
	                "鐝犳捣":[113.52,22.3],
	                "瀹胯縼":[118.3,33.96],
	                "鍜搁槼":[108.72,34.36],
	                "閾滃窛":[109.11,35.09],
	                "骞冲害":[119.97,36.77],
	                "浣涘北":[113.11,23.05],
	                "娴峰彛":[110.35,20.02],
	                "姹熼棬":[113.06,22.61],
	                "绔犱笜":[117.53,36.72],
	                "鑲囧簡":[112.44,23.05],
	                "澶ц繛":[121.62,38.92],
	                "涓存本":[111.5,36.08],
	                "鍚存睙":[120.63,31.16],
	                "鐭冲槾灞�":[106.39,39.04],
	                "娌堥槼":[123.38,41.8],
	                "鑻忓窞":[120.62,31.32],
	                "鑼傚悕":[110.88,21.68],
	                "鍢夊叴":[120.76,30.77],
	                "闀挎槬":[125.35,43.88],
	                "鑳跺窞":[120.03336,36.264622],
	                "閾跺窛":[106.27,38.47],
	                "寮犲娓�":[120.555821,31.875428],
	                "涓夐棬宄�":[111.19,34.76],
	                "閿﹀窞":[121.15,41.13],
	                "鍗楁槍":[115.89,28.68],
	                "鏌冲窞":[109.4,24.33],
	                "涓変簹":[109.511909,18.252847],
	                "鑷础":[104.778442,29.33903],
	                "鍚夋灄":[126.57,43.87],
	                "闃虫睙":[111.95,21.85],
	                "娉稿窞":[105.39,28.91],
	                "瑗垮畞":[101.74,36.56],
	                "瀹滃":[104.56,29.77],
	                "鍛煎拰娴╃壒":[111.65,40.82],
	                "鎴愰兘":[104.06,30.67],
	                "澶у悓":[113.3,40.12],
	                "闀囨睙":[119.44,32.2],
	                "妗傛灄":[110.28,25.29],
	                "寮犲鐣�":[110.479191,29.117096],
	                "瀹滃叴":[119.82,31.36],
	                "鍖楁捣":[109.12,21.49],
	                "瑗垮畨":[108.95,34.27],
	                "閲戝潧":[119.56,31.74],
	                "涓滆惀":[118.49,37.46],
	                "鐗′腹姹�":[129.58,44.6],
	                "閬典箟":[106.9,27.7],
	                "缁嶅叴":[120.58,30.01],
	                "鎵窞":[119.42,32.39],
	                "甯稿窞":[119.95,31.79],
	                "娼嶅潑":[119.1,36.62],
	                "閲嶅簡":[106.54,29.59],
	                "鍙板窞":[121.420757,28.656386],
	                "鍗椾含":[118.78,32.04],
	                "婊ㄥ窞":[118.03,37.36],
	                "璐甸槼":[106.71,26.57],
	                "鏃犻敗":[120.29,31.59],
	                "鏈邯":[123.73,41.3],
	                "鍏嬫媺鐜涗緷":[84.77,45.59],
	                "娓崡":[109.5,34.52],
	                "椹瀺灞�":[118.48,31.56],
	                "瀹濋浮":[107.15,34.38],
	                "鐒︿綔":[113.21,35.24],
	                "鍙ュ":[119.16,31.95],
	                "鍖椾含":[116.46,39.92],
	                "寰愬窞":[117.2,34.26],
	                "琛℃按":[115.72,37.72],
	                "鍖呭ご":[110,40.58],
	                "缁甸槼":[104.73,31.48],
	                "涔岄瞾鏈ㄩ綈":[87.68,43.77],
	                "鏋ｅ簞":[117.57,34.86],
	                "鏉窞":[120.19,30.26],
	                "娣勫崥":[118.05,36.78],
	                "闉嶅北":[122.85,41.12],
	                "婧ч槼":[119.48,31.43],
	                "搴撳皵鍕�":[86.06,41.68],
	                "瀹夐槼":[114.35,36.1],
	                "寮�灏�":[114.35,34.79],
	                "娴庡崡":[117,36.65],
	                "寰烽槼":[104.37,31.13],
	                "娓╁窞":[120.65,28.01],
	                "涔濇睙":[115.97,29.71],
	                "閭兏":[114.47,36.6],
	                "涓村畨":[119.72,30.23],
	                "鍏板窞":[103.73,36.03],
	                "娌у窞":[116.83,38.33],
	                "涓存矀":[118.35,35.05],
	                "鍗楀厖":[106.110698,30.837793],
	                "澶╂触":[117.2,39.13],
	                "瀵岄槼":[119.95,30.07],
	                "娉板畨":[117.13,36.18],
	                "璇告毃":[120.23,29.71],
	                "閮戝窞":[113.65,34.76],
	                "鍝堝皵婊�":[126.63,45.75],
	                "鑱婂煄":[115.97,36.45],
	                "鑺滄箹":[118.38,31.33],
	                "鍞愬北":[118.02,39.63],
	                "骞抽《灞�":[113.29,33.75],
	                "閭㈠彴":[114.48,37.05],
	                "寰峰窞":[116.29,37.45],
	                "娴庡畞":[116.59,35.38],
	                "鑽嗗窞":[112.239741,30.335165],
	                "瀹滄槍":[111.3,30.7],
	                "涔変箤":[120.06,29.32],
	                "涓芥按":[119.92,28.45],
	                "娲涢槼":[112.44,34.7],
	                "绉︾殗宀�":[119.57,39.95],
	                "鏍床":[113.16,27.83],
	                "鐭冲搴�":[114.48,38.03],
	                "鑾辫姕":[117.67,36.19],
	                "甯稿痉":[111.69,29.05],
	                "淇濆畾":[115.48,38.85],
	                "婀樻江":[112.91,27.87],
	                "閲戝崕":[119.64,29.12],
	                "宀抽槼":[113.09,29.37],
	                "闀挎矙":[113,28.21],
	                "琛㈠窞":[118.88,28.97],
	                "寤婂潑":[116.7,39.53],
	                "鑿忔辰":[115.480656,35.23375],
	                "鍚堣偉":[117.27,31.86],
	                "姝︽眽":[114.31,30.52],
	                "澶у簡":[125.03,46.58]
	            }
	        },
	        {
	            name: 'Top5',
	            type: 'map',
	            mapType: 'china',
	            data:[],
	            markPoint : {
	                symbol:'emptyCircle',
	                symbolSize : function (v){
	                    return 10 + v/100
	                },
	                effect : {
	                    show: true,
	                    shadowBlur : 0
	                },
	                itemStyle:{
	                    normal:{
	                        label:{show:false}
	                    }
	                },
	                data : ${top5}
	            }
	        }
	    ]
	};
	                   
//浣跨敤
	require(
		[
			'echarts',
			'echarts/chart/bar',
			'echarts/chart/line',
			'echarts/chart/pie',
			'echarts/chart/map'
		],
		function(ec){
			var myChart = ec.init(document.getElementById('main'));
			//涓篹chart鍔犺浇鏁版嵁
       	myChart.setOption(option);
		}
	);
</script>



<div id="main" style="height:600px"></div>              
</body>